CSI API ETABS v1
cDesignCompositeColumn.Eurocode_4_2004 Property
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
cDCompColEurocode_4_2004 Eurocode_4_2004 { get; }
ReadOnly Property Eurocode_4_2004 As cDCompColEurocode_4_2004
	Get
Dim instance As cDesignCompositeColumn
Dim value As cDCompColEurocode_4_2004
value = instance.Eurocode_4_2004
property cDCompColEurocode_4_2004^ Eurocode_4_2004 {
	cDCompColEurocode_4_2004^ get ();
}
abstract Eurocode_4_2004 : cDCompColEurocode_4_2004 with get
Property Value
Type: cDCompColEurocode_4_2004
See Also
Reference
cDesignCompositeColumn Interface
ETABSv1 Namespace